/******************************************************************
** ÎÄ¼şÃû:	DMsgSubAction.h
** ´´½¨ÈË:
** °æ  È¨:	(C)  	 
** ÈÕ  ÆÚ:	 
** °æ  ±¾:	0.1
** Ãè  Êö:	ÊµÌåĞĞÎªÊÂ¼şµÄ×ÓÏûÏ¢Âë£¬
**          ¼´£¬ÕâĞ©ÏûÏ¢ÂëµÄÖ÷ÂëÊÇROOTTHING_SC_MAIN_ACTION£¨»òÕßROOTTHING_CS_MAIN_ACTION£©
** Ó¦  ÓÃ:  ·şÎñÆ÷¡¢¿Í»§¶Ë
** ±¸  ×¢:   
**
**  ÏûÏ¢ÂëµÄÁ÷Í¨ÀàĞÍÈçÏÂ£º
**  CSC: ·şÎñÆ÷Óë¿Í»§¶ËÏà»¥Í¨ĞÅµÄÏûÏ¢Âë¡£
**
**  BCM: ·şÎñÆ÷¸÷¹¦ÄÜÓëÂß¼­¶ÔÏñÍ¨Öª¹ã²¥µÄÏûÏ¢Âë¡££¨Ö»»áÓÃÔÚ·şÎñÆ÷£©
**  SS: ·şÎñÆ÷¸÷¹¦ÄÜÏà»¥Í¨ĞÅµÄÏûÏ¢Âë¡££¨Ö»»áÓÃÔÚ·şÎñÆ÷£©
**
**  CC: ¿Í»§¶Ë¸÷¹¦ÄÜÏà»¥Í¨ĞÅµÄÏûÏ¢Âë¡££¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©
**  IC: ¿Í»§¶ËÊäÈëÉè±¸Óë¿Í»§¶Ë¹¦ÄÜÄ£¿éÍ¨ĞÅµÄÏûÏ¢Âë¡££¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©
**
**  CSC_S: ·şÎñÆ÷·¢¸ø·şÎñÆ÷Ä£¿éµÄCSCÀàĞÍ£¬Ïàµ±ÓÚÄ£Äâ¿Í»§¶Ë·¢µÄCSCÏûÏ¢£¨Ö»»áÓÃÔÚ·şÎñÆ÷£©
**  CSC_C: ¿Í»§¶Ë·¢¸ø¿Í»§¶ËÄ£¿éµÄCSCÀàĞÍ£¬Ïàµ±ÓÚÄ£Äâ·şÎñÆ÷·¢µÄCSCÏûÏ¢£¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©
**  IC_C: ¿Í»§¶Ë·¢¸ø¿Í»§¶ËÄ£¿éµÄICÀàĞÍ£¬Ïàµ±ÓÚÄ£ÄâÊäÈëÉè±¸·¢µÄICÏûÏ¢£¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©

**************************** ĞŞ¸Ä¼ÇÂ¼ ******************************
** ĞŞ¸ÄÈË: 
** ÈÕ  ÆÚ: 
** Ãè  Êö: 
********************************************************************/

#ifndef __DMSG_SUBACTION_H__
#define __DMSG_SUBACTION_H__

// ÊÂ¼şÀàĞÍID¶¨Òå
enum emEventType
{
	SRC_TYPE_ID_ROOT		= 0,	// ¸ù
	SRC_TYPE_ID_SYSTEM,				// ÏµÍ³
	SRC_TYPE_ID_ACTOR,				// Íæ¼Ò
	SRC_TYPE_ID_MONSTER,			// ¹ÖÎï 
	SRC_TYPE_ID_ITEM,				// ÎïÆ·
	SRC_TYPE_ID_CONTAINER,			// ÈİÆ÷
	SRC_TYPE_ID_CHAT,				// ÁÄÌì 
	SRC_TYPE_ID_BOX,				// ºĞ×Ó
	SRC_TYPE_ID_DUMMY,				// ¼ÙÈË
	SRC_TYPE_ID_TEAM,				// ×é¶Ó
	SRC_TYPE_ID_GAMEOBJ,			// ³¡¾°Îï¼ş
	SRC_TYPE_ID_UNION,				// ¼Ò×å
	SRC_TYPE_ID_HERO,				// Ó¢ĞÛ
	SRC_TYPE_ID_BATTLE,				// Õ½³¡
	SRC_TYPE_ID_SCRIPT_EVENT,		// ½Å±¾ÊÂ¼ş
	SRC_TYPE_ID_RANK,				// ´óÈüÅÅÃû
	SRC_TYPE_ID_MAX
};


//CIRCULTYPE£ºÁ÷Í¨ÀàĞÍ£¨4Î»£©
//ACTIONID£ºĞĞÎªÊÂ¼şµÄ×ÓÏûÏ¢Âë£¨8Î»£©
#define MAKE_MSGID(CIRCULTYPE, ACTIONID)	(CIRCULTYPE << 8 | ACTIONID)

//»ñÈ¡ÏûÏ¢µÄCIRCULTYPE£¨Á÷Í¨ÀàĞÍ£©
#define PARSE_CIRCULTYPE(MSGID)				(MSGID >> 8)

//»ñÈ¡ÏûÏ¢µÄACTIONID£¨ĞĞÎªÊÂ¼ş×ÓÏûÏ¢Âë£©
#define PARSE_ACTIONID(MSGID)				(MSGID & 0xFF)


//////////////////////////////////////////////////////////////////////////
///////////////////////////// ÏûÏ¢Á÷Í¨ÀàĞÍ ///////////////////////////////
//[CSC]:  ·şÎñÆ÷Óë¿Í»§¶ËÏà»¥Í¨ĞÅµÄÏûÏ¢Âë¡£
#define MAINACTION_CIRCULTYPE_CSC						1

//[BCM]:  ·şÎñÆ÷¸÷¹¦ÄÜÓëÂß¼­¶ÔÏñÍ¨Öª¹ã²¥µÄÏûÏ¢Âë£¨Ö»»áÓÃÔÚ·şÎñÆ÷£©
#define MAINACTION_CIRCULTYPE_BCM						2

//[SS]:  ·şÎñÆ÷¸÷¹¦ÄÜÏà»¥Í¨ĞÅµÄÏûÏ¢Âë£¨Ö»»áÓÃÔÚ·şÎñÆ÷£©
#define MAINACTION_CIRCULTYPE_SS						3

//[CC]:  ¿Í»§¶Ë¸÷¹¦ÄÜÏà»¥Í¨ĞÅµÄÏûÏ¢Âë£¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©
#define MAINACTION_CIRCULTYPE_CC						4

//[IC]:  ¿Í»§¶ËÊäÈëÉè±¸Óë¿Í»§¶Ë¹¦ÄÜÄ£¿éÍ¨ĞÅµÄÏûÏ¢Âë£¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©
#define MAINACTION_CIRCULTYPE_IC						5

//[CSC_S]:  ·şÎñÆ÷·¢¸ø·şÎñÆ÷Ä£¿éµÄCSCÀàĞÍ£¬Ïàµ±ÓÚÄ£Äâ¿Í»§¶Ë·¢µÄCSCÏûÏ¢£¨Ö»»áÓÃÔÚ·şÎñÆ÷£©
#define MAINACTION_CIRCULTYPE_CSC_S						6

//[CSC_C]:  ¿Í»§¶Ë·¢¸ø¿Í»§¶ËÄ£¿éµÄCSCÀàĞÍ£¬Ïàµ±ÓÚÄ£Äâ·şÎñÆ÷·¢µÄCSCÏûÏ¢£¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©
#define MAINACTION_CIRCULTYPE_CSC_C						7

//[IC_C]:  ¿Í»§¶Ë·¢¸ø¿Í»§¶ËÄ£¿éµÄICÀàĞÍ£¬Ïàµ±ÓÚÄ£ÄâÊäÈëÉè±¸·¢µÄICÏûÏ¢£¨Ö»»áÓÃÔÚ¿Í»§¶Ë£©
#define MAINACTION_CIRCULTYPE_IC_C						8

#define MAINACTION_MAX									MAINACTION_CIRCULTYPE_IC_C

//////////////////////////////////////////////////////////////////////////
/////////////////////// Õ½³¡ÊÂ¼şµÄ×ÓÏûÏ¢Âë ///////////////////////////
enum MAINACTION_BATTLE_EVENT
{
	EVENT_GAME_BIG_ROUND_BEGIN			= 1, 	// ´ó»ØºÏ¿ªÊ¼
	EVENT_GAME_SMALL_ROUND_BEGIN,				// Ğ¡»ØºÏ¿ªÊ¼
	EVENT_GAME_BIG_ROUND_END, 					// ´ó»ØºÏ½áÊø
	EVENT_GAME_SMALL_ROUND_END,					// Ğ¡»ØºÏ½áÊø
	EVENT_GAME_ROOM_PREPARE,					// ·¿¼äÓÎÏ·¿ªÊ¼
};

//////////////////////////////////////////////////////////////////////////
///////////////////// ´óÈüÅÅÃûÀà×ÓÏûÏ¢Âğ /////////////////////////////////
enum MAINACTION_RANK_EVENT
{
	EVENT_RANK_PLAYER_LEVELUP			= 1,	// Íæ¼ÒÉı¼¶
};

//////////////////////////////////////////////////////////////////////////
// EVENT_RANK_PLAYER_LEVELUP
struct SEventRankPlayerLevelUp_S
{
	s64	qwUserID;	// ÕËºÅID
	s32	lLevel;		// µÈ¼¶

	SEventRankPlayerLevelUp_S()
	{
		memset(this, 0, sizeof(*this));
	}
};
//////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////
/////////////////////// ÊµÌåĞĞÎªÊÂ¼şµÄ×ÓÏûÏ¢Âë ///////////////////////////
enum MAINACTION_MSGID
{
 
	/////////////////////////////////////////////////////////
	//Ãè        Êö£º³¡¾°·şµÇÂ¼»òÕßµÇ³öÖĞĞÄ·ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CS_LOGINOUT,
 
	// Âß¼­¶ÔÏó´´½¨ 
	MAINACTION_MSGID_CREATE ,

	// Âß¼­¶ÔÏóÏú»Ù
	MAINACTION_MSGID_DESTORY,

	// ÒÆ¶¯
	MAINACTION_MSGID_MOVE,

	// Õ¾Á¢
	MAINACTION_MSGID_STOPHERE,

	// ËÀÍö
	MAINACTION_MSGID_DIE,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_RELIVE
	//Ãè        Êö£ºÈËÎï¸´»î
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_RELIVE,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_RELIVE_TIME
	//Ãè        Êö£º¸üĞÂ¸´»îÊ±¼ä
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_RELIVE_TIME,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_CLOSERELIVEMSGBOX
	//Ãè        Êö£º¹Ø±Õ¸´»î¶Ô»°¿ò
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CLOSERELIVEMSGBOX,

	// ¼¼ÄÜ¹¥»÷
	MAINACTION_MSGID_SKILL_ATTACK,

	// ´«ËÍ
	MAINACTION_MSGID_NEW_WORLD,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºµã»÷Íê³ÉÈÎÎñ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_FINISHTASK,

	// ÉÌµêNPCµÄÎïÆ·ÁĞ±í
	MAINACTION_MSGID_LIST_INVENTORY,


	// ·şÎñÆ÷Æô¶¯³É¹¦ÊÂ¼ş
	MAINACTION_MSGID_START_OK,

	// Íæ¼ÒµÇÂ¼³É¹¦
	MAINACTION_MSGID_PLAYERLOGIN,

	// Íæ¼ÒµÇ³ö³É¹¦
	MAINACTION_MSGID_PLAYERLOGOUT,

	// µÇÂ¼Êı¾İ¿â·µ»Ø£¬Í¨ÖªÆäËûÄ£¿é¼ÓÔØÊı¾İ¿â
	MAINACTION_MSGID_PLAYERLOADDATABASE,

	// Íæ¼Ò¶¨Ê±±£´æÊı¾İ
	MAINACTION_MSGID_PLAYERSAVE,

	// ÎïÆ·Ïú»Ù
	MAINACTION_MSGID_DESTROY,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_OPENBOX
	//Ãè        Êö£ººĞ×ÓÏà¹ØµÄ²Ù×÷ÏûÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC, SS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_OPENBOX,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_RESBOX
	//Ãè        Êö£º×ÊÔ´ºĞ×ÓÏà¹ØµÄ²Ù×÷ÏûÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC, SS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_RESBOX,

	// ´´½¨ÈİÆ÷
	MAINACTION_MSGID_CONTAINER,

	// ±³°ü·¢Éú±ä»¯
	MAINACTION_MSGID_BAGS_CHG,

	// ¿ÉÒÔ´æ·ÅÎïÆ·
	MAINACTION_MSGID_BAG_VALIDE,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_RELEASE
	//Ãè        Êö£º¶ÔÏñÊÍ·Å
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_RELEASE,

	// ÊôĞÔ¸üĞÂ
	MAINACTION_MSGID_UPDATEPROP,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_CLEAN_SHOW
	//Ãè        Êö£ºË¢ĞÂÍâ¹Û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CLEAN_SHOW,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º×°±¸À¸ÖĞ×°±¸µÄÄÍ¾Ã·¢Éú±ä»¯
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC
	///////////////////////////////////////////////////////// 
	MAINACTION_MSGID_ENDURE,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_LOOK_ACTOR_EQUIP
	//Ãè        Êö£º¹Û²ìÍæ¼Ò×°±¸
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_LOOK_ACTOR_EQUIP,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_SYSTEMMESSAGE
	//Ãè        Êö£ºÏµÍ³ÏûÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS, CSC£¬BCM
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SYSTEMMESSAGE,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÉúÎïÏÔÊ¾×´Ì¬¸Ä±ä
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CRT_STATE_CHG,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÂß¼­->UI ¼¼ÄÜ×¼±¸
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_PREPARE,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÂß¼­->UI ¼¼ÄÜÊÍ·Å
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_CAST_OUT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÂß¼­->UI ÊÍ·ÅÉÁµçÁ´¼¼ÄÜµÄÏûÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_CHAIN_OUT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÂß¼­->UI ¼¼ÄÜÖĞ¶Ï
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_BREAK,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÈ¡Ïû¼¼ÄÜ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_CANCEL_UL,
	MAINACTION_MSGID_SKILL_CANCEL_LU,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¼¼ÄÜ³õÊ¼»¯
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_INIT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÉı¼¶¼¼ÄÜ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_UPGRADE_UL,
	MAINACTION_MSGID_SKILL_UPGRADE_LU,
	MAINACTION_MSGID_SKILL_UPGRADE_PET_UL,
	MAINACTION_MSGID_SKILL_UPGRADE_PET_LU,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÒÅÍü¼¼ÄÜ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_FORGET_PET_UL,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_UPGRADE_EXP
	//Ãè        Êö£ºÉı¼¶¹¦Ñ«µÈ¼¶
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_UPGRADE_EXP,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_OSS_TASK
	//Ãè        Êö£ºOOS ÈÎÎñ¼à¿ØÏûÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCSC
	MAINACTION_MSGID_OSS_TASK,


	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_MURDEROUS
	//Ãè        Êö£ºÉ±ÊÖ¶ÔµĞÈËÔì³ÉËÀÍö
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_MURDEROUS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¸üĞÂCDÊ±¼ä
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_COLD_UPDATA_LU,
	MAINACTION_MSGID_COLD_UPDATA_PET_LU,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º±ä¸üÃû×ÖÑÕÉ«
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PKNAMECOLOR,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÇĞ»»PKÄ£Ê½
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SWITCHPKMODE,

	MAINACTION_MSGID_OPENSHOP,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÏÔÊ¾Ïä×ÓÖĞËùÓĞÎïÆ·
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SHOWITEMS_INBOX,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÉı¼¶Í¨Öª
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_LEVELUP,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¹¥»÷
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ATTACK,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º±»¹¥»÷
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BE_ATTACK,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¸Ä±äÕ½¶·×´Ì¬
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºMAINACTION_CIRCULTYPE_CSC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGE_FIGHT_STATUS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¸üĞÂ¼¼ÄÜµã
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºMAINACTION_CIRCULTYPE_CSC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_UPDATA_POINT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¸üĞÂNPCÍ·¶¥±êÊ¶
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_NPCHEADFLAG,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÇĞ»»×´Ì¬
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SWITCHSTATE,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º·şÎñÆ÷Ê¹ÓÃµÀ¾ß(Ê¹ÓÃÒ©Æ·)
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_USEGOODS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¿ªÊ¼¶Á½ø¶ÈÌõ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_STARTPROGRESSBAR,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º½ø¶ÈÌõ½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ENDPROGRESSBAR,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º²¥·ÅÒôĞ§
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PLAYSOUND,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÊ¹ÓÃÒ©Æ·½á¹û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_USELEECHDOMRESULT,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    Âë£ºMAINACTION_MSGID_TRANSMAP
	//Ãè        Êö£ºÇĞ»»µØÍ¼£¬EntityServer·¢³öÕâ¸öÏûÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRANSMAP,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º´íÎóÂëÍ¨µÀ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ERRORCODECHUNNEL,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¼¼ÄÜ¸Ä±äÎ»ÖÃ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGELOCATIONFORSKILL,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÁ´½ÓÉç»á·ş³É¹¦ÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SOCIETYSVRLOGINED,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¶Ï¿ªÓëÉç»áµÄÁ´½Ó·şÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SOCIETYSVRLOGOUTED,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¸±±¾Âß¼­´¦Àí
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£º³¡¾°·ş->ÖĞĞÄ·ş
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CENTER_ECTYPE_PROCESS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¿Í»§¶Ë½»Ò×ÇëÇóÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_REQUEST,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º½»Ò×¿ªÊ¼
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_GO,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÈ¡Ïû½»Ò×
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_CANCEL,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º½ğÇ®ÊıÄ¿¸Ä±ä
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_UPDATE_MONEY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¸Ä±ä½»Ò×À¸ÖĞÎïÆ·(¼º½»ò¶Ô·½)
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_UPDATE_ITEMS,


	////////////////////////////////////////////////////////
	//Ãè        Êö£º¼ÓËø»òÕß½âËø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_LOCK,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºµãÁËÈ·¶¨
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_CONFIRM,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º½»Ò×Íê³É
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TRADE_FINISH,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍæ¼ÒÇĞ»»µØÍ¼
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ACTOR_CHANGE_MAP,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¸´»îÑ¯ÎÊ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ASK_RELIVE,

	/////////////////////////////////////////////////////////
	// Ãè	   Êö£ºÖØÖÃ¸±±¾
	// Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_RESET_ECTYPE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º×é¶ÓÇé¿ö±ä¸ü
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	//Êı¾İ½á¹¹£ºSTeamChangeInfo_SS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TEAM_CHANGE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¼¼ÄÜÊÍ·Å½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ATTACK_FINISH,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¸´»îµ¹¼ÆÊ±
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGEACTOR_INTERVAL,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍ¬²½·Ç¾Å¹¬¸ñÄÚËùÓĞµÄNPC
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SYNC_NPCINFO,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÈÎÎñÊı¾İ¼ÓÔØok
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºÈÎÎñÏµÍ³
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_TASK_DATA_LOADED_OK,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¸üĞÂAIÄ£Ê½
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CALL_ANIMAL_AIMODE,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º·şÎñÆ÷Ê¹ÓÃµÀ¾ß(´©×°±¸)
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ONEQUIP,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º·şÎñÆ÷Ê¹ÓÃµÀ¾ß(Ğ¶×°±¸)
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_UNEQUIP,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º½øÈëÕ½¶·×´Ì¬
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ENTER_FIGHT_STATUS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍÑÀëÕ½¶·×´Ì¬
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_LEAVE_FIGHT_STATUS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º·şÎñÆ÷µÇÂ¼/µÇ³öÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SERVER_LOGIN_LOGOUT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º·şÎñÆ÷¸üĞÂÈËÊı
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SERVER_ONLINE_UPDATE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÉÏÂí»»Íâ¹Û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_RIDE_MOUNT,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÏÂÂí»»Íâ¹Û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_DOWN_MOUNT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÑ¡ÔñÄ¿±ê
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SELECT_TARGET,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÊó±êÒÆ¶¯Íæ¼Ò
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_MOUSE_MOVE_PLAYER,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¿Í»§¶Ë¸Ä±äÅäÖÃ²ÎÊı
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGE_OPTION,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¿Í»§¶ËÒÆ³ıËùÓĞ¶ÔÏó
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BEFORE_REMOVE_ALL_OBJECT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¿Í»§¶Ë¼¼ÄÜÔ¤ÅĞ¶Ï
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SKILL_CAN_USE,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÒ÷³ª½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PREPARE_END,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º ÈÎÎñÍê³É¼à¿ØÊÂ¼şÏûÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	MAINACTION_MSGID_TASK_SYS_TASK_FINISH,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º ´ò¿ª²Ö¿â½çÃæ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	MAINACTION_MSGID_OPEN_STORAGE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º±äÉí
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGE_MODEL,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ººÏÌå
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_MERGE_MODEL,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º×Ô¶¨Òå¿ì½İÀ¸¸üĞÂ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_DEFINE_BAR_UPDATA,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º³ÁÄ¬Ğ§¹û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SLIENT_EFFECT,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º »ñµÃÉÌ³ÇÃ¿¸öTabÒ³ÉÏÉÌÆ·µÄ×î´óÊıÁ¿
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	MAINACTION_MSGID_GET_TAB_MAX_NUM,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º »ñµÃÉÌÆ·ÁĞ±í
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	MAINACTION_MSGID_GET_MALL_GOODS_LIST,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º ÔÙ´ÎÈ·ÈÏ¹ºÂòÉÌÆ·
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	MAINACTION_MSGID_RES_BUY_MIND_GOODS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º ¹ºÂòÉÌÆ·½á¹û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	MAINACTION_MSGID_RESULT_BUY_MIND_GOODS,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º ÕË»§Óà¶î²éÑ¯½á¹û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	MAINACTION_MSGID_PAY_INFO_QUERY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º·şÎñÆ÷¹ã²¥ÁôÑÔ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_CHAT_MSG_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º·şÎñÆ÷¹ã²¥¹ØÕÌ¯Î»
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_CLOSE_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÌ¯Î»×´Ì¬
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_STATUS_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÌ¯Î»Ãû
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_NAME_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º·ÅÈëÎïÆ·»Ø¸´
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_PUTONGOODS_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÈ¡ÏÂÎïÆ·»Ø¸´
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_PUTOFFGOODS_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºĞŞ¸ÄÎïÆ·»Ø¸´
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_MODIFYGOODS_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¹ºÂòÎïÆ·»Ø¸´
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_BUYGOODS_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍ¨Öª¹Ë¿ÍÔö¼ÓÒ»¸öÎïÆ·
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_CUSTOMER_ADD_GOODS_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍ¨Öª¹Ë¿ÍÒÆ³ıÒ»¸öÎïÆ·
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOOTH_CUSTOMER_REMOVE_GOODS_REPLY,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¸Ä±äÃû×Ö
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGE_NAME,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÒÆ¶¯ÊÂ¼ş£¨ÒşÉí×¨ÓÃ£©
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGE_LOC_HIDE_USE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º²»¾ßÓĞ·´ÒşÄÜÁ¦
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_NOT_HAS_SHOW_EFFECT,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º±¦Ê¯¸üĞÂÄ¿±ê·´ÒşÒıÓÃ¼ÆÊı
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_UPDATA_TARGET_UNHIDE_REF,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÊÇ·ñ¿´²»¼û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_IS_CAN_NOT_SEE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º¸üĞÂ×Ô¼ºµÄ×´Ì¬
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS¡¢CC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_UPDATA_HIDE_STATUS,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÒşÉí
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_HIDE_MODEL,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍæ¼ÒÅúÁ¿Êı¾İ¸üĞÂ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MSG_PLAYER_BATCH_UPDATE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º³èÎïÁĞ±í
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PETLIST_UPDATE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º³èÎï²Ù×÷
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PET_OPERATE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º³èÎï×°±¸¸ü»»
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PET_CHANGE_EQUIP,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º³èÎï¸ÄÃû(×Ô¼ºµÄ³èÎï,Õë¶Ô½çÃæ)
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PET_CHANGENAME,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º³èÎï¸ÄÃû(Õë¶Ô³¡¾°³èÎï,²»Ò»¶¨ÊÇ×Ô¼ºµÄ)
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PET_CHANGENAME_ALL,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÉèÖÃ³èÎïAI
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PET_SETAI,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º³èÎïÊµÌå´´½¨³É¹¦
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PET_ENTITY_CREATE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºtÖÆÔìÌ××°±¸½á¹û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_RESULT_MAKESUIT,
	/////////////////////////////////////////////////////////
	//Ãè        Êö£ºÕ½³¡Âß¼­´¦Àí
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£º³¡¾°·ş->Éç»á·ş
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SOCIETY_BATTLE_PROCESS,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º´ò¿ªÖÆÔìÌ××°±¸½á¹û
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_OPEN_MAKESUIT,

	// ³èÎïÊ¹ÓÃ¼¼ÄÜ
	MAINACTION_MSGID_SKILL_USE_PET,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º±äÉíË¢ĞÂÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºCC
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CHANGE_MODEL_RESHOW,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÕ½³¡Ä£¿é.Õ½³¡ÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BATTLE_EVENT,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºµØÍ¼¸üĞÂÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_MAP_UPDATE_EVENT,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍæ¼ÒÇĞ»»µØÍ¼(Íê³É¼´Íæ¼ÒÒÑ¾­½øÈëµØÍ¼)
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ACTOR_CHANGE_MAP_FINISH,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÍæ¼ÒºÏÌå
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ACTOR_MERGE,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºlua´ò¶Ï½ø¶ÈÌõ
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_LUA_BREAK,

	////////////////////////////////////////////////////////
	//Ãè        Êö£º½»»»±¦Ê¯
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_SWAP_GEM,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÊµÌå»ØºÏ½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_ENTITY_ROUND_END,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÊµÌå»ØºÏ½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BUFF_ROUND_END,

	/////////////////////////////////////////////////////////
	//Ãè        Êö£º¹Ø¿¨½ø¶È
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_INSTANCE_UPDATA,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_BATTLE_END
	//Ãè        Êö£ºÕ½¶·½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BATTLE_END,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_STRENGTHEN_CARD
	//Ãè        Êö£ººÏ³É
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_STRENGTHEN_CARD,

	////////////////////////////////////////////////////////
	//Ãè        Êö£ºÊµÌå¿ªÊ¼Õ½¶·
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BUFF_BATTLE_BEGIN,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_PVP_TRAIN_END
	//Ãè        Êö£ºÕ½¶·½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PVP_TRAIN_END,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_FRIEND_TRAIN_END
	//Ãè        Êö£ººÃÓÑÇĞ´è½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_FRIEND_TRAIN_END,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_INSTANCE_FINISH
	//Ãè        Êö£º¹Ø¿¨Í¨¹Ø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_INSTANCE_FINISH,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_COMB_INFO
	//Ãè        Êö£ºÁ¬»÷ĞÅÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_COMB_INFO,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_BOMB_INFO
	//Ãè        Êö£ºÕ¨µ¯ĞÅÏ¢
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_BOMB_INFO,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_PRODUCE_LEVELUP
	//Ãè        Êö£ºÌú½³ÆÌÉı¼¶ÊÂ¼ş
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_PRODUCE_LEVELUP,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_FRIEND_COLLECT
	//Ãè        Êö£ººÃÓÑÊÕ¼¯½áÊø
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_FRIEND_COLLECT,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_CLIENT_FINISH
	//Ãè        Êö£º¿Í»§¶Ë´¥·¢Íê³É
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_CLIENT_FINISH,

	/////////////////////////////////////////////////////////
	//Ïû  Ï¢    MAINACTION_MSGID_INSTANCE_COLLEC
	//Ãè        Êö£º¹Ø¿¨Õ÷ÊÕÍê³É
	//Ö§³ÖÁ÷Í¨ÀàĞÍ£ºSS
	/////////////////////////////////////////////////////////
	MAINACTION_MSGID_INSTANCE_COLLECT,


	// ×î´ó×ÓÏûÏ¢Âë
	MAINACTION_MSGID_MAX,
};

enum MAINCONTAINER_MSGID
{
	// ´ò¿ªÈİÆ÷
	MAINCONTAINER_CSC_OPEN,

	// ¹Ø±ÕÈİÆ÷
	MAINCONTAINER_CSC_CLOSE,

	// ÍùÈİÆ÷Ìí¼ÓÎïÆ·
	MAINCONTAINER_CSC_ADD,

	// ´ÓÈİÆ÷É¾³ıÎïÆ·
	MAINCONTAINER_CSC_REMOVE,

	// Í¨Öª¿Í»§¶Ë¸üĞÂ
	MAINCONTAINER_CSC_UPDATE,

	// Í¨Öª·şÎñÆ÷²ğ·ÖÎïÆ·
	MAINCONTAINER_CSC_SPLIT,

	// ÎïÆ·ÊıÁ¿¸Ä±ä
	MAINCONTAINER_SS_NUM_CHG
};

enum MAINSKEP_MSGID
{
	// ¸Ä±äĞéÄâÎïÆ·À¸µÄÈİÁ¿
	MSG_SKEP_CHANGESIZE,

	// Í¬²½ĞéÄâÎïÆ·À¸È¨ÏŞ
	MSG_SKEP_SYNCPOPEDOM,

	// Í¬²½ĞéÄâÎïÆ·À¸ÖĞÎïÆ·µÄÎ»ÖÃ
	MSG_SKEP_SYNC,

	// Ïú»ÙĞéÄâÎïÆ·À¸
	MSG_SKEP_DESTORYSKEP,

	MSG_SKEP_LINK,

	MSG_SKEP_SPLIT,

	MSG_SKEP_USE,

	MSG_SKEP_OBSERVER,
};

enum MAINTRADE_MSGID
{
	// È¡Ïû½»Ò×
	MSG_TRADE_CANCEL,

	// ÇëÇó½»Ò×
	MSG_TRADE_REQUEST,

	// ½ÓÊÜ½»Ò×
	MSG_TRADE_ACCEPT,

	// ½ÓÊÜ½»Ò×»Ø¸´
	MSG_TRADE_GO,

	// ¾Ü¾ø½»Ò×
	MSG_TRADE_REFUSE,

	// Ëø¶¨½»Ò×
	MSG_TRADE_LOCK,

	// È¡ÏûËø¶¨
	MSG_TRADE_UNLOCK,

	// ¸Ä±ä½ğÇ®
	MSG_TRADE_UPDATE_MONEY,

	// ·ÅÈë½»Ò×ÎïÆ·
	MSG_TRADE_SET_ITEM,

	// ÒÆ³ı½»Ò×ÎïÆ·
	MSG_TRADE_CLEAR_ITEM,

	// È·ÈÏ½»Ò×
	MSG_TRADE_CONFIRM,

	// ½»Ò×½áÊø
	MSG_TRADE_FINISH,

	// Íæ¼ÒÊôĞÔ¸üĞÂ
	MSG_PROPERTY_UPDATE,
};

enum ENUMMAIN_MIND
{
	// ÇëÇóÃ¿¸öTabÒ³ÉÏÉÌÆ·µÄ×î´óÊıÁ¿(¿Í»§¶Ë->·şÎñÆ÷)
	MSG_MIND_GET_TAB_MAX_NUM,

	// ÇëÇóÉÌÆ·ÁĞ±í(¿Í»§¶Ë->·şÎñÆ÷)
	MSG_MIND_GET_MIND_GOODS_LIST,

	// ÇëÇó¹ºÂòÉÌÆ·(¿Í»§¶Ë->·şÎñÆ÷)
	MSG_MIND_BUY_MIND_GOODS,

	// ÇëÇó¹ºÂòÉÌÆ·»Ø¸´(·şÎñÆ÷->¿Í»§¶Ë)
	MSG_MIND_RES_BUY_MIND_GOODS,

	// È·ÈÏ¹ºÂò»òÈ¡Ïû(¿Í»§¶Ë->·şÎñÆ÷)
	MSG_MIND_CONFIRM_BUY,

	// ¹ºÂòÉÌÆ·½á¹û(·şÎñÆ÷->¿Í»§¶Ë)
	MSG_MIND_RESULT_BUY_MIND_GOODS,

	// ÕËºÅÓà¶î²éÑ¯(¿Í»§¶Ë->·şÎñÆ÷ »ò ·şÎñÆ÷->¿Í»§¶Ë)
	MSG_MIND_PAY_INFO_QUERY,
};

/// ¼Ò×åÊÂ¼şÏûÏ¢Âë
enum ENUM_MAIN_UNION
{
	/// Ö÷½ÇÉ«¼ÓÈë¼Ò×å£¬½Óµ½¼Ò×åĞÅÏ¢£¨¿Í»§¶Ë->¿Í»§¶Ë£©
	MAINUNION_MSGID_MAINPLAYER_JOINUNION = 0,

	/// Ö÷½ÇÉ«Àë¿ª¼Ò×å£¨¿Í»§¶Ë->¿Í»§¶Ë£©
	MAINUNION_MSGID_MAINPLAYER_LEAVEUNION,
};


//×î´óÏûÏ¢Âë£¨Í¨¹ı MAKE_MSGID(CIRCULTYPE, ACTIONID) »ñµÃ£©
#define MAIN_ACTION_MSG_MAX					MAKE_MSGID(MAINACTION_MAX, MAINACTION_MSGID_MAX)


#pragma pack(push,1)

// µÇÂ¼ÖĞĞÄ·ş³É¹¦
#define EVENT_LOGIN_CENTER										8
struct SEventLoginCenter_S
{

};

// ÒÆ¶¯Íê³É
#define EVENT_CREATURE_DONEMOVE									9
// ³¡¾°·ş
struct SEventCreatureDoneMove_S
{

};

// ´´½¨ÊµÌå
#define EVENT_ENTITY_CREATEENTITY								11
// ³¡¾°·ş
struct SEventEntityCreateEntity_S
{
	LONGLONG		uidEntity;		// ÊµÌåuid
};

// ¹ÖÎï»òÕßÍæ¼ÒËÀÍö
#define EVENT_CREATURE_DIE										12
// ³¡¾°·ş
struct SEventCreatureDie_S
{
	LONGLONG		uidMurderer;		// Ä±É±ÕßµÄuid
};

// É¾³ıÊµÌå
#define EVENT_ENTITY_DESTROYENTITY								13
// ³¡¾°·ş
struct SEventEntityDestroryEntity_S
{
	LONGLONG		uidEntity;		// ÊµÌåuid
};
// ¿Í»§¶Ë
struct SEventEntityDestroryEntity_C
{
	LONGLONG		uidEntity;		// ÊµÌåuid
};


// ÊµÌåÌí¼ÓBUFF
#define EVENT_CREATURE_ADDBUFF									14
// ³¡¾°·ş£¨vote/execute£©
struct SEventCreatureAddBuff_S
{
	DWORD			dwBuffID;		// buff id
	LONGLONG		uidAdd;			// ±¾buffµÄÌí¼ÓÕß
};
// ¿Í»§¶Ë
struct SEventCreatureAddBuff_C
{
	DWORD			dwIndex;		// buff index
	DWORD			dwFlashID;		// ¹âĞ§ID
	DWORD			dwRandFlashID;	// Ëæ»úĞ§¹û¹âĞ§
};

// ÊµÌåÒÆ³ıBUFF
#define EVENT_CREATURE_REMOVEBUFF								15
// ³¡¾°·ş£¨vote/execute£©
struct SEventCreatureRemoveBuff_S
{
	DWORD			dwBuffID;		// buff id
	LONGLONG		uidRemove;		// ÒÆ³ıÕß
};

// ¿Í»§¶Ë
struct SEventCreatureRemoveBuff_C
{
	DWORD			dwIndex;		// buff index
};

// µã»÷NPC
#define EVENT_PERSON_MEETNPC									16
// ³¡¾°·ş
struct SEventPersonMeetNpc_S
{
	LONGLONG		uidMaster;		// Ë­µãµÄNPC
	LONGLONG		uidNPC;			// ºÎ¸öNPC
};

// ÊµÌå¹¥»÷
#define EVENT_CREATURE_USE_SKILL								17
struct SEventUseSkill_S
{
	LONGLONG		uidUnit;		  // ¶ÔÏó
	s32     		nSkillID;			// ¼¼ÄÜid
  s32         nSkillType;   // (1~5£ºµØË®»ğ·çÀ×)
};


// ÊµÌå±»¹¥»÷
#define EVENT_CREATURE_BE_USE_SKILL								18
// struct SEventUseSkill_S

// ÊµÌåÎ»ÖÃ±ä¸ü
#define EVENT_CREATURE_CHANGELOC								19
// ³¡¾°·ş
struct SEventCreatureChangeLoc_S
{
	DWORD			dwOldRoomID;	// ¾É³¡¾°ID
	POINT			ptOldTile;		// ¾ÉTile
	DWORD			dwNewRoomID;	// ĞÂ³¡¾°ID
	POINT			ptNewTile;		// ĞÂTile
	bool			bSameServer;	// ¾É³¡¾°ÓëĞÂ³¡¾°ÊÇ·ñÎªÍ¬·şÎñÆ÷
};
// ¿Í»§¶Ë
struct SEventCreatureChangeLoc_C
{
	POINT			ptOldTile;		// ¾ÉTile
	POINT			ptNewTile;		// ĞÂTile
};

// ÊµÌå±»ÉËº¦
#define EVENT_CREATURE_INJURED									20
struct SEventCreatureInjured_S
{
	LONGLONG		uidMurderer;			// Ğ×ÊÖ
	DWORD			dwHPDamage;				// HPÉËº¦
	DWORD			dwMPDamage;				// MPÉËº¦
	s32				nAttackType;			// ¹¥»÷ÀàĞÍ
};

// ÊµÌå¿ªÊ¼ÒÆ¶¯
#define EVENT_CREATURE_STARTMOVE								21

// ÊµÌå¹¥»÷½áÊø
#define EVENT_CREATURE_USE_SKILLFINISHED							22

// ÊµÌåÖ÷¶¯ÉËº¦
#define EVENT_CREATURE_HARM										23
struct SEventCreatureHarm_S
{
	LONGLONG		uidCasualty;			// ±»¹¥»÷Õß
	DWORD			dwHPDamage;				// HPÉËº¦
	DWORD			dwMPDamage;				// MPÉËº¦
	s32				nAttackType;			// ¹¥»÷ÀàĞÍ
};

// ÈËÎï½ø¶ÈÌõ×´Ì¬¿ªÊ¼ÊÂ¼ş
#define EVENT_PERSON_PROGRESSBARSTART							24
// ³¡¾°·ş£¨vote/execute£©
struct SEventPersonProgressBarStart_S
{
	BYTE byBarType;					// ½ø¶ÈÌõÀàĞÍ
	int nTime;						// ³ÖĞøÊ±¼ä
	char szName[32];				// ½ø¶ÈÌõµÄÃû×Ö
};

// ÈËÎï½ø¶ÈÌõ×´Ì¬½áÊøÊÂ¼ş
#define EVENT_PERSON_PROGRESSBAREND								25
// ³¡¾°·ş£¨vote/execute£©
struct SEventPersonProgressBarEnd_S
{
	enum
	{
		PB_INVALID = 0,
		PB_WORK_SKILL,				// ¹¤×÷¼¼ÄÜ½ø¶ÈÌõ
		PB_OPEN_DOOR,				// ´ò¿ª³¡¾°Îï¼şÃÅ½ø¶ÈÌõ
		PB_STAND_FLAG,				// ´ò¿ª³¡¾°Îï¼şÕ¼Áìµã½ø¶ÈÌõ
		PB_OPEN_BOX,				// ´ò¿ª³¡¾°ºĞ×Ó½ø¶ÈÌõ
		PB_RIDE_STATE,				// ÆïÂí×´Ì¬
		PB_TREASURE_IDENTIFY,		// ²Ø±¦Í¼¼ø¶¨½ø¶ÈÌõ
		PB_TREASURE_USE,			// ²Ø±¦Í¼Ê¹ÓÃ½ø¶ÈÌõ
		PB_RUNLUAFUNCTION,			// ÔËĞĞLUAº¯Êı
		PB_PET_OUT,					// ³èÎï³öÕ½
	};

	int			nEndReason;			// ½áÊøÔ­Òò
	LONGLONG	uidMaster;			// ½ø¶ÈÌõ²¿¼şµÄÖ÷ÈË
	char		userData[128];		// µÚÒ»¸ö×Ö½ÚÓÃÓÚ·Å½ø¶ÈÌõÀàĞÍ
	int			nDataLen;
};

// ÆïÂí½ø¶ÈÌõÉÏÏÂÎÄ
struct SRideProgressBarContext_S
{
	SRideProgressBarContext_S()
	{
		nBufferID = 0;
		uidGoodsID = 0;
		byBufferLv = 0;
	}
	int			nBufferID;			// buffer ID
	LONGLONG	uidGoodsID;			// ÎïÆ·µÄguid
	BYTE		byBufferLv;			// buffer µÈ¼¶
};

// ¼ø¶¨½ø¶ÈÌõÉÏÏÂÎÄ
struct STreasureIdentifyProgressBarContext
{
	LONGLONG uidTreasure;

	STreasureIdentifyProgressBarContext()
	{
		memset( this, 0, sizeof(*this) );
	}
};

// ²Ø±¦Í¼Ê¹ÓÃ½ø¶ÈÌõÉÏÏÂÎÄ
struct STreasureUseProgressBarContext
{
	LONGLONG uidTreasure;

	STreasureUseProgressBarContext()
	{
		memset( this, 0, sizeof(*this) );
	}
};

struct SRunLuaFunctionProgressBarContext_S
{
	LONGLONG uidGoods;
	char	 szLuaFunctionname[64];
	SRunLuaFunctionProgressBarContext_S()
	{
		memset(this, 0, sizeof(*this));
	}
};

// ÇĞ»»µØÍ¼
struct SS_TANSMAP_ACTION_CONTEXT
{
	enum TANSMAP_MODE
	{
		TANSMAP_MODE_NEXTROOM = 0,
	};
	int	lTansMode;
	int	lTargetMapID;
	POINT	ptTargetPos;
	SS_TANSMAP_ACTION_CONTEXT()
	{
		memset( this, 0, sizeof(*this) );
	}
};

#define EVENT_PERSON_SWITCHSTATE								26

// ÊµÌåÔÊĞíÊ¹ÓÃ¼¼ÄÜ
#define EVENT_ALOW_USE_SKILL									27

/// ³èÎï´Ó³¡¾°É¾³ı£¬ÊÕ»Øµ½Íæ¼Ò
#define EVENT_PET_DEL_SCENE										28


// ¹ÖÎï»òÕßÍæ¼ÒËÀÍö
#define EVENT_CREATURE_KILL										29
// ³¡¾°·ş
struct SEventCreatureKill_S
{
	LONGLONG		uidDie;		// ±»É±ÕßµÄuid
};

// HP¸üĞÂ
#define EVENT_CREATURE_HP_UPDATA								30
// MP¸üĞÂ
#define EVENT_CREATURE_MP_UPDATA								31

/***************************************************************/
///////////////////////// ÏµÍ³ÊÂ¼şÂë ////////////////////////////
/***************************************************************/
// ¹¹½¨ÁË³¡¾°
#define EVENT_SYSTEM_BUILDROOM									1
// ³¡¾°·ş£¨vote / execute£©
struct SEventSystemBuildRoom_S
{
	DWORD			dwMapID;		// µØÍ¼ID
	DWORD			dwRoomID;		// ³¡¾°ID
};

// ¿Í»§¶Ë
struct SEventSystemBuildRoom_C
{
	DWORD			dwMapID;		// µØÍ¼ID
	DWORD			dwRoomID;		// ³¡¾°ID
};

// Ïú»ÙÁË³¡¾°
#define EVENT_SYSTEM_DESTORYROOM								2
// ³¡¾°·ş£¨vote / execute£©
struct SEventSystemDestoryRoom_S
{
	DWORD			dwMapID;		// µØÍ¼ID
	DWORD			dwRoomID;		// ³¡¾°ID
};

// ¿Í»§¶Ë
struct SEventSystemDestoryRoom_C
{

};
// µ¯³öÏµÍ³ÏûÏ¢
#define MSG_SYSTEM_CLIENT_MSGCENTER_POP							3

// Íæ¼Ò/¹ÖÎïËÀÍöÏûÏ¢
#define MSG_SYSTEM_CREATURE_DIE									4
struct SEventSystemCreatureDie_S
{
	LONGLONG	uiDieID;			// ËÀÕßµÄuid
	LONGLONG	uiMurderID;			// Ä±É±ÕßµÄuid
};

//////////////////////////////////////////////////////////////////////////
////////////////////////////////ÈİÆ÷ÀàÊÂ¼ş////////////////////////////////
//////////////////////////////////////////////////////////////////////////
#define	MSG_C_CREATE											1
#define MSG_C_RELEASE											2
struct SC_MSG_CONTAINER
{
	int nCMD;			// ÈİÆ÷Àà×ÓÃüÁî
	int nContainerID;	// ÈİÆ÷Id
	int nCSize;			// ÈİÆ÷´óĞ¡
	int nLocation;		// ÈİÆ÷Î»ÖÃ
};

//////////////////////////////////////////////////////////////////////////
/////////////////////////////ĞéÄâÎïÆ·À¸ÀàÊÂ¼ş/////////////////////////////
//Í¨Öª¿Í»§¶Ë´´½¨ĞéÄâÎïÆ·À¸
struct SBuildBoxExtendContext
{
	LONGLONG	uidBox;
};
struct SBuildShopmallExtendContext
{
	LONGLONG	uidNPC;
};
//Í¬²½ĞéÄâÎïÆ·À¸×î´óÈİÁ¿
struct SMsgSkepChangeSize_SC
{
	WORD	wMaxSize;	// ĞéÄâÎïÆ·À¸×î´óÈİÁ¿
};

//Í¬²½ĞéÄâÎïÆ·À¸È¨ÏŞ
struct SMsgSkepSyncPopedom_SC
{
	DWORD	dwPopedom;	// ĞéÄâÎïÆ·À¸È¨ÏŞ
};

struct SSyncSkepGoods
{
	int			nPlace;			// ÎïÆ·ÔÚĞéÄâÎïÆ·À¸ÖĞµÄÎ»ÖÃ
	LONGLONG	uidGoods;		// ĞéÄâÀ¸ÖĞÎïÆ·µÄuid
	DWORD		dwRelaySkepID;	// ½»»¥µÄĞéÄâÎïÆ·ÀºId
	BYTE		byLink;			// ÕæÊµÎïÆ·ÊÇ·ñÒÑÁ´½Ó(0:·ñ 1:ÊÇ)
};

struct SMsgSkepLink_CS
{
	DWORD		dwSrcSkepID;	// Ô´ĞéÄâÎïÆ·À¸Id
	int			nSrcPlace;		// Ô´Î»ÖÃ
	int			nTrgContainId;	// Ä¿±êÈİÆ÷Id
	int			nTrgPlace;		// ĞÂÎ»ÖÃ
};

struct SMsgSkepObserver_CS
{
	BYTE		byOpen;			// (0:¹Ø±Õ 1:´ò¿ª)
};

struct SMsgSkepSplit_CS
{
	int			nSplitNum;		// ÊıÁ¿
	LONGLONG	uidGoods;		// ÎïÆ·uid
	int			nPlace;			// ĞéÄâÎïÆ·À¸ÖĞµÄÎ»ÖÃ
};

struct SMsgSkepUse_CS
{
	LONGLONG	uidGoods;		// ÎïÆ·uid
	int			nPlace;			// ĞéÄâÎïÆ·À¸ÖĞµÄÎ»ÖÃ
};

/***************************************************************/
/////////////////// Í¨ÓÃÎïÆ·ÀºÊÂ¼şÂë ////////////////////////////
/***************************************************************/
// ÏòÍ¨ÓÃÎïÆ·ÀºÌí¼ÓÎïÆ·
#define EVENT_SKEP_ADDSKEPGOODS									1
// ³¡¾°·ş£¨vote / execute£©
/* Ö»ÓĞÆ¾¿ÕÌí¼ÓÎïÆ·Ê±£¬²Å»á´¥·¢´ËÊÂ¼ş£¬±ÈÈç´ÓÉÌµêÀïÂò½øÒ»¸öÎïÆ·¾Í
»á´¥·¢´ËÊÂ¼ş£¬´ÓÒ»¸öÎïÆ·Àº×ªÒÆµ½ÁíÒ»¸öÎïÆ·ÀºÊÇ²»»á´¥·¢´ËÊÂ¼ş£¬±È
Èç´Ó²Ö¿âÍÏÎïÆ·µ½°ü¹üÀ¸¡£Ò²¾ÍÖ»ÓĞÊµÔÚÍ¨ÓÃÎïÆ·À¸²Å»á´¥·¢//*/
struct SEventSkepAddSkepGoods_S
{
	LONGLONG		uidOperater;	// ²Ù×÷Õß
	LONGLONG		uidGoods;		// ÎïÆ·UID
	int				nPlace;			// Ìí¼ÓÎ»ÖÃ
};

// ÏòÍ¨ÓÃÎïÆ·ÀºÉ¾³ıÎïÆ·
#define EVENT_SKEP_REMOVESKEPGOODS								2
// ³¡¾°·ş£¨vote / execute£©
/* Ö»ÓĞÆ¾¿ÕÒÆ³ıÎïÆ·Ê±£¬²Å»á´¥·¢´ËÊÂ¼ş£¬±ÈÈçÈÎÎñNPC´Ó°ü¹üÀ¸ÊÕ×ßÈÎÎñ
ÎïÆ·¡£Ò²¾ÍÖ»ÓĞÊµÔÚÍ¨ÓÃÎïÆ·À¸²Å»á´¥·¢//*/
struct SEventSkepRemoveSkepGoods_S
{
	LONGLONG		uidOperater;	// ²Ù×÷Õß
	LONGLONG		uidGoods;		// ÎïÆ·UID	
	int				nPlace;			// ÒÆ³ıÎ»ÖÃ
};

// Í¨ÓÃÎïÆ·ÀºÄÚÒªÊÍ·ÅÁË
#define EVENT_SKEP_DESTORYSKEP									3
// ·şÎñÆ÷
struct SEventSkepDestorySkep_S
{
	DWORD			dwSkepID;		// ÎïÆ·ÀºID
}; 

// ¿Í»§¶Ë
// ÄÚ²¿²»¸ºÔğÊÍ·Å¿Í»§¶Ëskep£¬ÒòÎªµ£ĞÄÍâ²¿ºÜ¶àµØ·½
// ±£´æÁËËüµÄÖ¸Õë£¬ÈÃËûµÄ¹ÜÀíÕßÀ´ÊÍ·Å£¬±ÈÈçÎïÆ·Àº
// µÄskep£¬ÈÃÎïÆ·ÀºÀ´ÊÍ·Å
struct SEventSkepDestorySkep_C
{
	DWORD			dwSkepID;		// ÎïÆ·ÀºID
};

// Çå¿ÕÍ¨ÓÃÎïÆ·Àº
#define EVENT_SKEP_CLEANSASHSKEP								4
// ³¡¾°·ş£¨vote / execute£©
/* Íâ²¿µ÷ÓÃISkep::CleanÇå¿ÕÎïÆ·ÀºÊ±£¬»á´¥·¢´ËÊÂ¼ş£¬²»ÂÛÁ´½ÓÎïÆ·Àº»¹
ÊÇÊµÔÚÎïÆ·Àº¶¼»á´¥·¢//*/
struct SEventSkepCleanSashSkep_S
{
	LONGLONG		uidOperater;	// ²Ù×÷Õß
};

// Á´½ÓÎïÆ·
#define EVENT_SKEP_LINKSKEPGOODS								5
// ³¡¾°·ş£¨vote / execute£©
/* Á´½ÓÎïÆ·À¸£º½«µ±ÎïÆ·´ÓÒ»¸öÎïÆ·ÀºÍÏµ½Á´½ÓÎïÆ·À¸Ê±£¬ÔÚ×öÕæÕıÖ´ĞĞ²Ù
×÷Ê±£¬´¥·¢·ñ¾öÊÂ¼ş¡£Ö´ĞĞ²Ù×÷ÓĞÒÔÏÂ¼¸ÖÖ½á¹û£º
1¡¢½«±¾ÎïÆ·À¸µÄÎïÆ·´ÓÒ»¸öÎ»ÖÃÒÆ¶¯µ½±ğµÄÎ»ÖÃ
2¡¢½«ÆäËûÊµÔÚÎïÆ·À¸Á´½Óµ½±¾ÎïÆ·À¸
ÊµÔÚÎïÆ·À¸£º½«µ±ÎïÆ·´ÓÒ»¸öÎïÆ·À¸ÍÏµ½ÊµÔÚÎïÆ·À¸Ê±£¬ÔÚ×öÕæÕıÖ´ĞĞ²Ù
×÷Ê±£¬´¥·¢·ñ¾öÊÂ¼ş£¬Ö´ĞĞ²Ù×÷ÓĞÒÔÏÂ¼¸ÖÖ½á¹û£º
1¡¢Èç¹ûÊÇÁ´½ÓÎïÆ·£¬Ôò»¹Ô­ÎïÆ·Á´½Ó¹ØÏµ£¬Ê¹±¾ÎïÆ·Àº²»
ÔÙÁ´½ÓÁË¡£³É¹¦ºó£¬·¢EVENT_SKEP_LINKSKEPGOODSÊÂ¼ş
2¡¢Èç¹ûÊÇÊµÔÚÎïÆ·£¬²¢ÇÒÄ¿±êÎ»ÖÃÃ»ÓĞÎïÆ·£¬Ôò×ªÒÆ´ËÎï
Æ·´Ó±¾ÎïÆ·ÀºÖÁ±¾ÎïÆ·Àº£¬±ÈÈç´Ó²Ö¿âÍÏµ½ÎïÆ·À¸£¬³É
¹¦ºó·¢EVENT_SKEP_LINKSKEPGOODS.
3¡¢Èç¹ûÊÇÊµÔÚÎïÆ·£¬²¢ÇÒÄ¿±êÎ»ÖÃÓĞÎïÆ·£¬ÔòÓĞ¿ÉÄÜĞèÒª
´¥·¢ºÏ²¢ÊÂ¼ş£¬µ±´¥·¢EVENT_SKEP_UNITESKEPGOODSÊÂ¼ş£¬
Ôò±íÊ¾ºÏ²¢³É¹¦£¬Ò²¾ÍÊÇÈ«²¿ºÏ²¢³É¹¦
4¡¢Èç¹û²»ÄÜºÏ²¢£¬¾Í»áÔÚÁ½¸öÊµÔÚÎïÆ·À¸Ö®¼ä½»»»ÎïÆ·£¬
ÏÈ·¢EVENT_SKEP_EXCHANGESKEPGOODSÍ¶Æ±ÊÂ¼ş£¬Èç¹ûÃ»
ÓĞ·ñ¾öÔò»áÖ´ĞĞ½»»»ÊÂ¼ş£¬ÔÙ·¢
EVENT_SKEP_EXCHANGESKEPGOODSÖ´ĞĞÊÂ¼ş¡£²»ÔÙ·¢
EVENT_SKEP_LINKSKEPGOODSÊÂ¼şÁË
//*/
struct SEventSkepLinkSkepGoods_S
{
	LONGLONG		uidOperater;	// ²Ù×÷Õß
	LONGLONG		uidGoods;		// ÎïÆ·UID

	DWORD			dwSrcSkepID;	// Ô´ÎïÆ·Àº
	DWORD			dwSrcPlace;		// Ô´Î»ÖÃ

	int				nTargetSkepID;	// Ä¿±êÎïÆ·Àº
	int				nTargetPlace;	// Ä¿±êÎ»ÖÃ
};

// ¿Í»§¶Ë£¨vote£©
struct SEventSkepLinkSkepGoods_C
{	
	LONGLONG		uidGoods;		// ÎïÆ·UID

	DWORD			dwSrcSkepID;	// Ô´ÎïÆ·Àº
	DWORD			dwSrcPlace;		// Ô´Î»ÖÃ

	DWORD			dwTargetSkepID;	// Ä¿±êÎïÆ·Àº
	int				nTargetPlace;	// Ä¿±êÎ»ÖÃ
};

// ½»»»ÎïÆ·
#define EVENT_SKEP_EXCHANGESKEPGOODS							6
// ³¡¾°·ş£¨vote / execute£©
struct SEventSkepExchangeSkepGoods_S
{
	LONGLONG		uidOperater;	// ²Ù×÷Õß

	//////////////////////////////////////////////
	DWORD			dwSkepID1;		// ÎïÆ·Àº1
	int				nSkepPlace1;	// ÎïÆ·Àº1Î»ÖÃ
	LONGLONG		uidGoods1;		// ÎïÆ·UID

	//////////////////////////////////////////////
	DWORD			dwSkepID2;		// ÎïÆ·Àº2
	int				nSkepPlace2;	// ÎïÆ·Àº2Î»ÖÃ
	LONGLONG		uidGoods2;		// ÎïÆ·UID
};

// ºÏ²¢ÎïÆ·£¨Ö»ÊÊÓÃÓÚÈ«²¿ºÏ²¢£©
#define EVENT_SKEP_UNITESKEPGOODS								7
// ³¡¾°·ş£¨execute£©
struct SEventSkepUniteSkepGoods_S
{
	LONGLONG		uidOperater;	// ²Ù×÷Õß
	LONGLONG		uidGoods;		// ÎïÆ·UID

	DWORD			dwSkepID;		// ÎïÆ·Àº
	int				nPlace;			// ÎïÆ·ÀºÎ»ÖÃ

	int				nUniteQty;		// ºÏ²¢ÊıÁ¿

	bool			bAddTime;		// ÊÇ·ñÎªÌí¼ÓÊ±

	bool			bLinkTime;		// ÊÇ·ñÎªÁ´½ÓÊ±
	DWORD			dwSrcSkepID;	// Á´½ÓÊ±µÄÔ´ÎïÆ·Àº
};

// Í¨ÓÃÎïÆ·Àº²ğ·ÖÎïÆ·
#define EVENT_SKEP_SPLITGOODS									8
// ³¡¾°·ş£¨vote / execute£©
struct SEventSkepSplitGoods_S
{
	LONGLONG		uidOperator;	// ²Ù×÷Õß
	LONGLONG		uidGoods;		// ÎïÆ·UID

	DWORD			dwSkepID;		// ÎïÆ·ÀºID
	DWORD			dwPlace;		// Î»ÖÃ	

	DWORD			dwSplitNum;		// ²ğ·ÖÊıÁ¿	

	LONGLONG		uidNewGoods;	// ²ğ·ÖºóÎïÆ·
};

// ¿Í»§¶Ë
struct SEventSkepSplitGoods_C
{
	LONGLONG		uidGoods;		// ÎïÆ·UID

	DWORD			dwSkepID;		// ÎïÆ·ÀºID
	DWORD			dwPlace;		// Î»ÖÃ	

	DWORD			dwSplitNum;		// ²ğ·ÖÊıÁ¿		
};

// Í¨ÓÃÎïÆ·ÀºÄÚÄ³Î»ÖÃ·¢ÉúÁË±ä»¯
#define EVENT_SKEP_PLACECHANGE									9
// ¿Í»§¶Ë
struct SEventSkepPlaceChange_C
{
	DWORD			dwSkepID;		// ÎïÆ·ÀºID
	DWORD			dwPlace;		// Î»ÖÃ
};
struct SEventSkepGoods_C
{
	LONGLONG		uidGoods;		// ÎïÆ·uid
	DWORD			dwPlace;		// Î»ÖÃ
};

// Í¨ÓÃÎïÆ·ÀºÄÚĞŞ¸ÄÁËÈİÁ¿
#define EVENT_SKEP_CHANGESIZE									10
// ¿Í»§¶Ë
struct SEventSkepChangeSize_C
{
	DWORD			dwSkepID;		// ÎïÆ·ÀºID
	DWORD			dwMaxSize;		// ´óĞ¡
};

// Ê¹ÓÃÒ©Æ·
#define EVENT_ENTITY_USELEECHDOM								11
// ¿Í»§¶Ë
struct SEventEntityUseLeechdom_C
{
	LONGLONG	uidGoods;			// ÎïÆ·UID
	DWORD		dwSkepID;			// ÎïÆ·ÀºID
	DWORD		dwPlace;			// ÎïÆ·Î»ÖÃ
};

//³¡¾°·ş ×é¶ÓÇé¿ö±ä¸ü
//×ÓÏûÏ¢Âë MAINACTION_MSGID_TEAM_CHANGE
struct STeamChangeInfo_SS
{
	enum
	{
		STC_Join,
		STC_Leave,
		STC_Kick,
		STC_CaptainChange,
	};

	BYTE bChangeType;     //±ä¸üÀàĞÍ ¼ûÉÏÃæÃ¶¾Ù
	DWORD dwTeamID;       //¶ÓÎéID
	DWORD dwMemberID;     //±ä¸ü³ÉÔ±ID
};

// ÖĞĞÄ·ş ÏµÍ³ÄÚ·¢ËÍ·şÎñÆ÷µÇÂ¼µÇ³öÊÂ¼ş
struct SServerLoginLogout_SS
{
	enum
	{
		TYPE_INVALID = 0,
		TYPE_LOGIN,
		TYPE_LOGOUT,
		TYPE_NUM,
	};

	BYTE	byOpType;	// ²Ù×÷ÀàĞÍ£¬µÇÂ¼/µÇ³ö
	BYTE	bySvrType;	// ·şÎñÆ÷ÀàĞÍ £»¼û"DCenterServerMsg.h"µÄ¶¨Òå
	char	szIP[20];
	WORD	wPort;
	DWORD	dwParam;	// ±¸ÓÃ²ÎÊı

	SServerLoginLogout_SS()
	{
		memset(this,0,sizeof(SServerLoginLogout_SS));
	}
};

// ÉÏÂí
struct SClientRideMount_CC
{
	int nHorseResID;	// ÂíµÄ×ÊÔ´ID
	int nActionIndex; // Ê¹ÓÃµÚ¼¸Ì×¶¯×÷

	SClientRideMount_CC()
	{
		memset(this,0,sizeof(SClientRideMount_CC));
	}
};

struct SChangeOption_CC
{
	int optType;	  // ÅäÖÃ²ÎÊı
	int value; // ĞŞ¸ÄºóµÄÖµ

	SChangeOption_CC()
	{
		memset(this,0,sizeof(SChangeOption_CC));
	}
};

// Íê³ÉÈÎÎñÊÂ¼ş
struct SFinishTask_SS
{
	int	lActorID;	// ½ÇÉ«ID
	int	lTaskID;	// ÈÎÎñID
	
	SFinishTask_SS()
	{
		memset(this,0,sizeof(*this));
	}
};

//////////////////////////////////////////////////////////////////////////
// ÉÌ³ÇÏà¹Ø½á¹¹Ìå

// MSG_MIND_GET_TAB_MAX_NUM
struct SMsgActionGetTabMaxNumInfo_SC
{
	BYTE			byTotalTabNum;	// TabÒ³×ÜÊıÁ¿

	//////////////////////////////////////////////////////////////////////////
	//...byTotalTabNum¸öBYTE£¬Ã¿¸öBYTE±íÊ¾Ã¿¸öTabÒ³ÖĞÉÌÆ·µÄ×ÜÊıÁ¿
};

// MSG_MIND_GET_MIND_GOODS_LIST
struct SMsgActionGetMindGoodsList_CS
{
	BYTE			byTabIndex;		// ±êÇ©Ò³ÏÂ±ê
	BYTE			byBgnGoodsIdx;	// ´ÓµÚ¼¸¸ö¿ªÊ¼
	BYTE			byPageGoodsNum;	// ÇëÇó¸öÊı
};

// MSG_MIND_GET_MIND_GOODS_LIST
struct SMsgActionMindGoodsInfoList_SC
{
	BYTE			byTabIndex;		// ±êÇ©Ò³ÏÂ±ê
	BYTE			byBgnGoodsIdx;	// ´ÓµÚ¼¸¸ö¿ªÊ¼
	BYTE			byPageGoodsNum;	// ÇëÇó¸öÊı
	BYTE			byGoodsNum;		// ÉÌÆ·¸öÊı
};

struct SMsgActionMindGoodsInfo
{
	int			lGoodsId;			// ÎïÆ·Id
	BYTE			byIsBind;			// ÊÇ·ñÇ¿ÖÆ°ó¶¨(1:¹ºÂòºóÇ¿ÖÆ°ó¶¨, 0:¸ù¾İ°ó¶¨×Ö¶Î¾ö¶¨)
	BYTE			byIsCircle;			// ÊÇ·ñÑ­»·(1:¸ù¾İÅäÖÃµÄÉÏÏÂ¼ÜÊ±¼äÑ­»·Ö´ĞĞ, 0:²»Ñ­»·)
	int			lServerTime;		// ·şÎñÆ÷Ê±¼ä
	int			lUpTime;			// ÉÏ¼ÜÊ±¼ä(0:Ê¼ÖÕ´¦ÓÚÉÏ¼Ü×´Ì¬£»ÏŞÊ±ÉÏ¼Ü¸ñÊ½£ºÄê+ÔÂ+ÈÕ+Ê±+·Ö+Ãë)
	int			lDownTime;			// ÏÂ¼ÜÊ±¼ä(0:Ê¼ÖÕ´¦ÓÚÉÏ¼Ü×´Ì¬£»ÏŞÊ±ÏÂ¼Ü¸ñÊ½£ºÄê+ÔÂ+ÈÕ+Ê±+·Ö+Ãë)
	int			lPrice;				// Ôª±¦Ô­¼Û
	int			lRebatePrice;		// Ôª±¦ÕÛºó¼Û
	int			lBindPrice;			// °ó¶¨Ôª±¦Ô­¼Û
	int			lBindRebatePrice;	// °ó¶¨Ôª±¦ÕÛºó¼Û
};

// MSG_MIND_BUY_MIND_GOODS
struct SMsgActionBuyMindGoods_CS
{
	BYTE			byTabIndex;		// ±êÇ©Ò³ÏÂ±ê
	BYTE			byGoodsIndex;	// µÚ¼¸¸öÎïÆ·
	BYTE			byGoodsNum;		// ¹ºÂòÎïÆ·ÊıÁ¿
	BYTE			byMoneyType;	// Ê¹ÓÃ»õ±ÒÀàĞÍ(0:Ôª±¦,1:°ó¶¨Ôª±¦)
};

// MSG_MIND_RES_BUY_MIND_GOODS
struct SMindMoneyInfo
{
	BYTE			byMoneyType;	// Ê¹ÓÃ»õ±ÒÀàĞÍ(0:Ôª±¦,1:°ó¶¨Ôª±¦)
	int			lMoneyNum;		// »õ±ÒÊıÁ¿
};
struct SMsgActionResBuyMindGoods_SC
{
	int			lGoodsId;		// ÎïÆ·Id
	BYTE			byGoodsNum;		// ÎïÆ·ÊıÁ¿
	SMindMoneyInfo	sNeedMoney;		// ĞèÒª¶àÉÙÉÌ³Ç»õ±Ò
};

// MSG_MIND_CONFIRM_BUY
struct SMsgActionConfirmBuy_CS
{
	BYTE			byResult;		// ÊÇ·ñ¹ºÂò(0:È¡Ïû, 1:È·ÈÏ)
};

// MSG_MIND_RESULT_BUY_MIND_GOODS
struct SMsgActionResultBuyMindGoods_SC
{
	BYTE			byResult;		// ¹ºÂò½á¹û
	//////////////////////////////////////////////////////////////////////////
	// Èç¹û¹ºÂò³É¹¦, ´øÉÏÊ£ÓàÉÌ³Ç»õ±Ò(Ôª±¦»ò°ó¶¨Ôª±¦)
};

// MSG_MIND_PAY_INFO_QUERY
struct SMsgActionPayInfoQuery_SC
{
	int		lPayNum;				// ·µ»ØÊ£ÓàÔª±¦ÊıÁ¿
};

// MAINACTION_MSGID_MAP_UPDATE_EVENT
// ÖĞĞÄ·şµØÍ¼/³¡¾°¸üĞÂĞÅÏ¢
struct SMapUpdateContext
{
	BOOL	bLogin;		// ÊÇ·ñÎªµÇÂ¼
	DWORD	dwMapID;	// µØÍ¼±àºÅ

	SMapUpdateContext()
	{
		memset(this,0,sizeof(*this));
	}
	SMapUpdateContext(BOOL bLogin_,DWORD dwMapID_)
	{
		bLogin = bLogin_;
		dwMapID = dwMapID_;
	}
};

// MAINACTION_MSGID_FRIEND_COLLECT
struct SEventFriendCollect_S
{
	s32	nFriendID;		// ºÃÓÑID

	SEventFriendCollect_S()
	{
		nFriendID = 0;
	}
};

// MAINACTION_MSGID_INSTANCE_COLLECT
struct SEventInstanceCollect_S
{
	s32	lType;		// 0:ÆÕÍ¨Õ÷ÊÕ, 1:Ç¿ÖÆÕ÷ÊÕ

	SEventInstanceCollect_S()
	{
		lType = 0;
	}
};

// MAINACTION_MSGID_BATTLE_END
struct SEventBattleResult_S
{
	s32	nInstanceID;		// ¹Ø¿¨ID
	s32	nCreatureID;		// ¹ÖÎïID
	s32	nRoundCount;		// »ØºÏÊı
	BOOL bWin;				// ÊÇ·ñÊ¤Àû

	SEventBattleResult_S()
	{
		nInstanceID = 0;
		nCreatureID = 0;
		nRoundCount = 0;
		bWin = FALSE;
	}
};

// MAINACTION_MSGID_STRENGTHEN_CARD
struct SEventStrengthenResult_S
{
	s32	nGoodID;			    // ²úÎï
	s32	nType;				    // ºÏ³ÉÀàĞÍ
	s32	nSubType;			    // ºÏ³É×ÓÀàĞÍ
	s32	nStrengthLevel;		// Åä·½µÈ¼¶
	BOOL bIsOK;				    // ÊÇ·ñ³É¹¦

	SEventStrengthenResult_S()
	{
		nGoodID = 0;
    nType = 0;
    nSubType = 0;
    nStrengthLevel = 0;
		bIsOK = FALSE;
	}
};

// MAINACTION_MSGID_INSTANCE_FINISH
struct SEventInstanceFinish_S
{
	s32	nInstanceID;		// ¹Ø¿¨ID
	s32	nHardType;		// ÄÑ¶È

	SEventInstanceFinish_S()
	{
		nInstanceID = 0;
		nHardType = 0;
	}
};

// MAINACTION_MSGID_PRODUCE_LEVELUP
struct SEventProduceLevelUp_S
{
	s32	nSubType;			// ºÏ³É×ÓÀàĞÍ

  SEventProduceLevelUp_S()
	{
    nSubType = 0;
	}
};

#pragma pack(pop)

#endif //__DMSG_SUBACTION_H__
